Merge branch 'main' into feature/resource-harvest-staking
